<template>
  <div class="container">
    <h1 style="text-align:center">新人FAQ</h1>
    <h2>关于账户注册/实名</h2>
    <h4>怎么注册账号？</h4>
    <p>点击APP左侧“注册”按钮即可注册成为会员。请注意用户名为11位手机号，密码长度至少8-18个字符（A-Z，a-z，0-9） 、支付密码为6位有效数字。不得设置111111 或 123456等过于简单的支付密码，并请将密码严格保密。</p>
    <h4>怎么实名？</h4>
    <p>用户点击我的-实名认证 按提示引导填写或上传相关证件，平台不会对用户的敏感信息保留或缓存，请放心操作。完成实名即刻体验挖矿乐趣！</p>
    <h2>关于矿池</h2>
    <h4>怎么投入矿池？</h4>
    <p>根据自身持有的FMC投入到对应的矿池中、在指定的周期内获得相应的收益，当持有达到上限将不能在投入。</p>
    <h4>矿池的收益如何？</h4>
    <p>参照下图：</p>
    <el-image :src="imgUrl" fit="fill"></el-image>

    <h2>关于达人</h2>
    <h4>什么是达人？</h4>
    <p>达人是作为超级贡献者的一种权益、当用户晋升为达人后可获得对应达人等级的手续费分红。</p>
    <h4>怎么成为达人？</h4>
    <p>具体请参照APP内达人晋升。</p>
    <h4>达人是永久的吗？</h4>
    <p>不是，达人会根据自身数据的增减而浮动。具体请参照APP内达人晋升。</p>
    <h4>达人的奖励是怎么样的？</h4>
    <p>V1获得每日交易手续费 22%分红</p>
    <p>V2获得每日交易手续费 15%分红</p>
    <p>V3获得每日交易手续费 8%分红</p>
    <p>V4获得每日交易手续费 5%分红</p>

    <h2>关于体验卷</h2>
    <h4>怎么获得体验券？</h4>
    <p>注册实名并添加支付管理后可获得赠送的100FMC作为建设资产。</p>
    <h4>体验券的有效期？</h4>
    <p>有效期为72小时，逾期不领取则失效无法补足。领取后则计算收益并领取，到期后自动回收。</p>
    <h4>体验券能多次获得吗？</h4>
    <p>不能，每个用户只有一次获得机会。</p>

    <h2>关于投票</h2>
    <h4>为什么要投票？</h4>
    <p>投票是为了用户能切身参与到平台的走向，在指定某些规则之初向用户征求意见从而产生决策。</p>
    <h4>投票的规则？</h4>
    <p>持有闲置C数量大于1的用户，拥有一票有效投票权。当持有的数量小于1时，则默认弃权。</p>

    <h2>关于矿池转让</h2>
    <h4>什么是矿池转让？</h4>
    <p>通过矿池的转让来达到提前回收自己的资产目的。转让是将原来的持有人通过将资产的全部或部分转移于第三人。债权转让主要是为了提高用户投资的流动性。当出借人需要使用资金时，如果所投资的矿池还没到期，就可以通过转让矿池给其他投资人，从而完成矿池转让和获得资产流动。</p>
    <h4>转让有什么要求？</h4>
    <p>待定... ...</p>

    <h2>关于加息券</h2>
    <h4>怎么获得加息券？</h4>
    <p>当用户在特定情况下触发彩蛋后可获得加息券抽奖机会。</p>
    <h4>加息券怎么使用？</h4>
    <p>当用户已经获得加息券后，点击使用后下一次投入矿池的收益将额外获得加息收益。</p>

    <h2>关于算力</h2>
    <h4>什么是算力？</h4>
    <p>算力是晋升达人的重要环节之一、也是其矿池收益的重要体现之一。</p>
    <h4>怎么获得算力？</h4>
    <p>每个有效用户（注册-实名-绑定支付-激活体验券）可获得0.01GH算力，同时邀请有效好友也可获得相应算力。</p>
    <h4>邀请好友的算力是怎么算的？</h4>
    <p>邀请校友下级好友将获得0.01GH算力，直推有效下级好友投入矿池后上家也将得到对应算力奖励，计算方式如下：</p>
    <p>下级投入10矿池 奖励上级0.1GH。</p>
    <p>下级投入100矿池 奖励上级1GH。</p>
    <p>下级投入500矿池 奖励上级51GH。</p>
    <p>下级投入1000矿池 奖励上级10GH。</p>
    <p>下级投入5000矿池 奖励上级50GH。</p>
    <p>下级投入10000矿池 奖励上级100GH。</p>
    <h2>关于交易规则</h2>
    <h4>每日交易时间？</h4>
    <p>每天交易开放时间为08:00-23:00。</p>
    <h4>交易手续费是多少？</h4>
    <p>手续费30%由卖家支出。</p>
    <h4>交易有哪些类别？</h4>
    <p>普通区数量1-200个单笔多次 、大宗区数量300-1000个单笔单次。</p>
    <h4>恶意扰乱秩序怎么办？</h4>
    <p>对于恶意扰乱交易秩序的用户第一次72小时内不得交易、第二次将冻结其账户72小时、累计第三次将永久封号。请用户遵守并打造良好秩序，珍惜账号权益。</p>
    <h4>买家没有打款上传假凭证、卖家没有按时放行怎么办？</h4>
    <p>买家/卖家可发起申述由平台裁定，如举证属实将对买家/卖家视累计次数对应处罚。</p>

  </div>
</template>

<script>
export default {
  name: "FAQ",
  data() {
    return {
      imgUrl: require('@/assets/faq1.png')
    };
  },
  computed: {

  },
  watch: {

  },
  methods: {

  }
};
</script>

<style lang="scss" scoped>
.container{
    // background: #283443;
    // color: white;
    padding: 1rem;
    p{
        line-height: 1.5rem;
    }
}
</style>
