<template>
  <div class="container">
    <h1 style="text-align:center">用户注册协议</h1>
    <h3>一、用户注册</h3>
    <p>在您注册成为蜂窝正式用户之前请确认年龄在18至55周岁，您同意本协议并注册成功即成为蜂窝的注册用户直至您的账户注销。蜂窝可能在必要的时候对本协议条款及蜂窝各单项服务协议进行更改，您可以选择停止使用蜂窝相关的服务或者注销您的账户，否则将认为您同意更改后的服务条款。未在蜂窝发布或在具体服务过程中未经蜂窝告知的服务条款将不具有法律效力。</p>

    <h3>二、用户账户</h3>
    <p>您应当拥有完全民事权利能力和完全民事行为能力，否则您和能够代表您行使权利或承担责任的自然人将承担一切后果。</p>
    <p>如果使用蜂窝提供的各单项服务，您可能还需要提交其他相关的资料和信息。为了提供更好的服务，您也可以向我们提供其他资料和信息，我们将按照蜂窝的隐私政策保护您的资料和信息。</p>
    <p>您应当保护好您的账户，除非已经得到您的提前通知，蜂窝将认为您的账户处于您的控制之下。如果您的账户在不受您控制的情况下处于风险状态或者已经发生损失，请您及时以有效方式通知蜂窝，您可以要求蜂窝暂停服务或者冻结账户。</p>
    <h3>三、账户管理</h3>
    <p>1、蜂窝帐号的所有权归蜂窝所有，用户完成申请注册手续后，获得蜂窝帐号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。蜂窝因经营需要，有权回收用户的蜂窝帐号。</p>
    <p>2、用户可以更改、删除蜂窝帐户上的个人资料、注册信息及传送内容等，但需注意，删除有关信息的同时也会删除用户储存在系统中的文字和图片。用户需承担该风险。</p>
    <p>3、用户有责任妥善保管注册帐号信息及帐号密码的安全，因用户保管不善可能导致遭受盗号或密码失窃，责任由用户自行承担。用户需要对注册帐号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的帐号或密码。在用户怀疑他人使用其帐号或密码时，用户同意立即通知蜂窝。</p>
    <p>4、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，蜂窝在通知用户后有权依据协议中断或终止对违约用户蜂窝帐号提供服务。</p>
    <p>5、如用户注册蜂窝帐号后长时间不登录，通知用户后，商标圈可以注销该帐号，以免造成资源浪费，由此造成的不利后果由用户自行承担。</p>
    <h3>四、用户责任</h3>
    <p>用户使用蜂窝必须遵守所有适用的国家法律、地方法规和国际准则。用户对用户账户进行的一切操作及言论负完全的责任，用户注销账户后，仍然应当对注销前的操作和言论负责。</p>

    <p>用户必须遵循：</p>
    <p>（1）使用网络服务不作非法用途</p>
    <p>（2）不干扰或混乱网络服务</p>
    <p>（3）遵守所有使用网络服务的网络协议、规定、程序和惯例。</p>
    <p>用户须承诺不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽等信息资料。用户也不能传输任何教唆他人构成犯罪行为的资料。不得进行任何有可能对蜂窝的系统造成任何不良的影响的操作，未经许可而非法进入其它电脑系统是禁止的。若用户的行为不符合以上提到的服务条款，蜂窝单方面有权冻结或注销用户账户。用户需对用户本身在网上的行为承担法律责任。用户若在蜂窝上散布和传播反动、色情或其他信息，蜂窝的系统记录有可能作为用户违反法律的证据。</p>

    <h3>五、数据储存</h3>
    <p>1、蜂窝不对用户在本服务中相关数据的删除或储存失败负责。</p>
    <p>2、蜂窝可以根据实际情况自行决定用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。用户可根据自己的需要自行备份本服务中的相关数据。</p>
    <p>3、如用户停止使用本服务或本服务终止，蜂窝可以从服务器上永久地删除用户的数据。本服务停止、终止后蜂窝没有义务向用户返还任何数据。</p>
    <h3>六、风险承担</h3>
    <p>1、用户理解并同意，蜂窝仅为用户提供信息分享、传送及获取的平台，用户必须为自己注册帐号下的一切行为负责，包括用户所传送的任何内容以及由此产生的任何后果。用户应对蜂窝及本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险蜂窝无法且不会对因用户行为而导致的任何损失或损害承担责任。</p>
    <p>如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务，请立即向蜂窝举报或投诉，将依本协议约定进行处理。</p>
    <p>2、用户理解并同意，蜂窝保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。</p>
    <h3>七、蜂窝服务</h3>
    <p>用户应当按照蜂窝的服务规则和页面提示进行操作，蜂窝各单项服务协议与本协议冲突或是有特别规定的，应当优先适用各单项服务协议。</p>
    <p>蜂窝有权根据有关政策的变化、市场情况、服务范围变化等原因，单方面调整服务标准，调整的项目将在蜂窝上更新，不作额外的通知。蜂窝有权拒绝为不按照蜂窝要求提供信息或不服从蜂窝服务规则的用户提供服务，有权注销或者冻结该用户账户。</p>
    <p>蜂窝的数据来源于互联网，版权归源网站所有，平台通过技术手段对信息进行汇总实现快照，无法避免后续网站内容的变更，汇总的数据如有出入本站不承担责任。</p>
    <p>蜂窝没有为用户保存账户各项资料和记录的义务。</p>
    <h3>八、蜂窝免责条款</h3>
    <p>蜂窝不保证提供的服务不受干扰、及时提供或免于出错。蜂窝不保证所提供的服务具有适销性、适用性，蜂窝不对用户的真实身份进行核实。除非有效法律文书明确要求并提供相应保护，蜂窝将遵守隐私政策，不对外提供用户信息。</p>
    <p>因下列情形无法按照约定提供各项服务时，蜂窝不承担责任，包括但不限于：</p>
    <p>（1）蜂窝公告的休假或者系统维护的。</p>
    <p>（2）电信设备出现故障不能进行数据传输的。</p>
    <p>（3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成蜂窝障碍不能提供服务的。</p>
    <p>（4）由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟的。</p>
    <h3>九、其他</h3>
    <p>蜂窝通过公告通知，公告的时间为送达到用户的时间；通过蜂窝APP向用户提醒，提醒出现的时间为送达的时间；通过用户提供的联系方式向用户送达，用户或其代表签收、用户系统接收的时间为送达的时间。</p>

  </div>
</template>

<script>
export default {
  name: "UserAgre",
  data() {
    return {

    };
  },
  computed: {

  },
  watch: {

  },
  methods: {

  }
};
</script>

<style lang="scss" scoped>
.container{
    // background: #283443;
    // color: white;
    padding: 1rem;
    p{
        line-height: 1.5rem;
    }
}
</style>
